hurrican/wita-acceptance-test/src/citrus/resources/templates/cdm/v1/TAL_BEREIT_NEU_26/talBereitNeu26.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderService/v1">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <createOrder xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderService/v1">
            <order>
                <externeAuftragsnummer>${externe.auftrags.nummer}</externeAuftragsnummer>
                <kunde>
                    <kundennummer>${kunde.kunden.nummer}</kundennummer>
                    <leistungsnummer>${kunde.leistungs.nummer}</leistungsnummer>
                </kunde>
                <geschaeftsfall>
                    <NEU>
                        <BKTOFaktura>${bkto.faktura}</BKTOFaktura>
                        <ansprechpartner>
                            <auftragsmanagement>
                                <anrede>9</anrede>
                                <vorname>TestFirstName</vorname>
                                <nachname>${ansprechpartner.nachname}</nachname>
                                <telefonnummer>089 0000000</telefonnummer>
                                <emailadresse>hurrican_developer@m-net.de</emailadresse>
                            </auftragsmanagement>
                        </ansprechpartner>
                        <termine>
                            <kundenwunschtermin>
                                <datum>${kundenwunschtermin.datum}</datum>
                                <zeitfenster>${kundenwunschtermin.zeitfenster}</zeitfenster>
                            </kundenwunschtermin>
                        </termine>
                        <auftragsposition>
                            <produkt>
                                <kategorie>TAL</kategorie>
                                <bezeichner>TAL; CuDA 2 Draht hbr (HVt)</bezeichner>
                            </produkt>
                            <geschaeftsfallProdukt>
                                <TAL>
                                    <standortA>
                                        <firma>
                                            <anrede>@ignore@</anrede>
                                            <firmenname>@ignore@</firmenname>
                                        </firma>
                                        <strasse>
                                            <strassenname>Mitteldeichstr.</strassenname>
                                            <hausnummer>8</hausnummer>
                                            <hausnummernZusatz>a</hausnummernZusatz>
                                        </strasse>
                                        <gebaeudeteil>
                                            <gebaeudeteilName>Gebäudeteil</gebaeudeteilName>
                                            <gebaeudeteilZusatz>GebäudeteilZusatz</gebaeudeteilZusatz>
                                        </gebaeudeteil>
                                        <land>de</land>
                                        <postleitzahl>26919</postleitzahl>
                                        <ort>
                                            <ortsname>Brake</ortsname>
                                            <ortsteil>a.d.XYZ</ortsteil>
                                        </ort>
                                        <lageTAE_ONT>Keller</lageTAE_ONT>
                                    </standortA>
                                    <standortB>
                                        <strasse>
                                            <strassenname>Georgstr.</strassenname>
                                            <hausnummer>1</hausnummer>
                                            <hausnummernZusatz>a</hausnummernZusatz>
                                        </strasse>
                                        <postleitzahl>26919</postleitzahl>
                                        <ort>
                                            <ortsname>Brake</ortsname>
                                            <ortsteil>zusatz</ortsteil>
                                        </ort>
                                        <lageKollokationsraum>
                                            <ONKZ>4401</ONKZ>
                                            <anschlussbereich>1</anschlussbereich>
                                        </lageKollokationsraum>
                                    </standortB>
                                    <ansprechpartnerMontage>
                                        <anrede>9</anrede>
                                        <vorname>Montage</vorname>
                                        <nachname>Wita</nachname>
                                        <telefonnummer>0821 532324</telefonnummer>
                                        <emailadresse>hurrican_developer@m-net.de</emailadresse>
                                    </ansprechpartnerMontage>
                                    <uebertragungsverfahren>H04</uebertragungsverfahren>
                                    <schaltangaben>
                                        <schaltung>
                                            <kupfer>
                                                <UEVT>1PH1</UEVT>
                                                <EVS>01</EVS>
                                                <doppelader>01</doppelader>
                                            </kupfer>
                                        </schaltung>
                                    </schaltangaben>
                                </TAL>
                            </geschaeftsfallProdukt>
                        </auftragsposition>
                    </NEU>
                </geschaeftsfall>
            </order>
        </createOrder>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>